<a href="https://colab.research.google.com/github/Liigyareaa/DemoProject/blob/main/Untitled10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
##importing libraries 
import pandas as pd 
import numpy as np

In [ ]:
##Creating dataframe using pandas library 
xog = { 'Student_Name':['Vijay', 'Sundar', 'Satyam', 'Indira'],'age':[23, 45,
46, 52 ]}
data = pd.DataFrame(xog)
data.head()

  Student_Name  age
0        Vijay   23
1       Sundar   45
2       Satyam   46
3       Indira   52

In [ ]:
## Creating Dataframe using list
data_holder = [{'Studentname':'Ismail','Age':20,'Facuty':'Computer science'}]
test = pd.DataFrame(data_holder,columns =['Studentname','Age','Facuty'])
test.head()

     Name  Age
0  Ismail   23
1   Farah   30

In [ ]:
##Louding dataframe
info = pd.read_csv("WHO_first9cols.csv")
info.describe()

In [ ]:
# Show the shape of DataFrame
print("Shape:", info.shape)

In [ ]:
# Check the column list of DataFrame
print("The dataframe colums are:",info.columns)

The dataframe colums are: Index(['Country', 'CountryID', 'Continent', 'Adolescent fertility rate (%)',
       'Adult literacy rate (%)',
       'Gross national income per capita (PPP international $)',
       'Net primary school enrolment ratio female (%)',
       'Net primary school enrolment ratio male (%)',
       'Population (in thousands) total'],
      dtype='object')

In [ ]:
##The datatype of columsn
print("The datatype of columns:",info.dtypes)

The datatype of columns: Country                                                    object
CountryID                                                   int64
Continent                                                   int64
Adolescent fertility rate (%)                             float64
Adult literacy rate (%)                                   float64
Gross national income per capita (PPP international $)    float64
Net primary school enrolment ratio female (%)             float64
Net primary school enrolment ratio male (%)               float64
Population (in thousands) total                           float64
dtype: object

In [ ]:
##Reading single column of our dataframe
country_column = info['Country']
##slicing the country column
country_column[-5:]

197               Vietnam
198    West Bank and Gaza
199                 Yemen
200                Zambia
201              Zimbabwe
Name: Country, dtype: object

In [ ]:
### selecting multiple columns 
 filtered_colums=info[['CountryID','Country','Continent','Adolescent fertility rate (%)','Adult literacy rate (%)']]
# Show top 5 records
filtered_colums.head()

   CountryID  ... Adult literacy rate (%)
0          1  ...                    28.0
1          2  ...                    98.7
2          3  ...                    69.9
3          4  ...                     NaN
4          5  ...                    67.4

[5 rows x 5 columns]

In [ ]:
# Select rows using index 
filtered_colums[4: 10]

   CountryID  ... Adult literacy rate (%)
4          5  ...                    67.4
5          6  ...                     NaN
6          7  ...                    97.2
7          8  ...                    99.4
8          9  ...                     NaN
9         10  ...                     NaN

[6 rows x 5 columns]

In [ ]:
## Pandas DataFrames : Pandas dataframe has a lot of functions which can describe the data 
##describe function :This method returns a small table with descriptive statistics.
info.describe()

        CountryID  ...  Population (in thousands) total
count  202.000000  ...                     1.890000e+02
mean   101.500000  ...                     3.409964e+04
std     58.456537  ...                     1.318377e+05
min      1.000000  ...                     2.000000e+00
25%     51.250000  ...                     1.328000e+03
50%    101.500000  ...                     6.640000e+03
75%    151.750000  ...                     2.097100e+04
max    202.000000  ...                     1.328474e+06

[8 rows x 8 columns]

In [ ]:
##count function 
info.count()

Country                                                   202
CountryID                                                 202
Continent                                                 202
Adolescent fertility rate (%)                             177
Adult literacy rate (%)                                   131
Gross national income per capita (PPP international $)    178
Net primary school enrolment ratio female (%)             179
Net primary school enrolment ratio male (%)               179
Population (in thousands) total                           189
dtype: int64

In [ ]:
##mad function :calculates the mean absolute deviation
info.mad()

CountryID                                                    50.500000
Continent                                                     1.608960
Adolescent fertility rate (%)                                40.604616
Adult literacy rate (%)                                      16.556401
Gross national income per capita (PPP international $)     9600.489837
Net primary school enrolment ratio female (%)                13.094348
Net primary school enrolment ratio male (%)                  11.304017
Population (in thousands) total                           44131.698553
dtype: float64

In [ ]:
##Median function : calculates the median 
info.median()

CountryID                                                  101.5
Continent                                                    3.0
Adolescent fertility rate (%)                               46.0
Adult literacy rate (%)                                     86.5
Gross national income per capita (PPP international $)    6175.0
Net primary school enrolment ratio female (%)               90.0
Net primary school enrolment ratio male (%)                 90.0
Population (in thousands) total                           6640.0
dtype: float64

In [ ]:
##min function  : returns the minimum number of the each colum 
info.min()

Country                                                   Afghanistan
CountryID                                                           1
Continent                                                           1
Adolescent fertility rate (%)                                       0
Adult literacy rate (%)                                          23.6
Gross national income per capita (PPP international $)            260
Net primary school enrolment ratio female (%)                       6
Net primary school enrolment ratio male (%)                        11
Population (in thousands) total                                     2
dtype: object

In [ ]:
##max : returns the maxim value 
info.max()

Country                                                      Zimbabwe
CountryID                                                         202
Continent                                                           7
Adolescent fertility rate (%)                                     199
Adult literacy rate (%)                                          99.8
Gross national income per capita (PPP international $)          60870
Net primary school enrolment ratio female (%)                     100
Net primary school enrolment ratio male (%)                       100
Population (in thousands) total                           1.32847e+06
dtype: object

In [ ]:
##mode : returns the mode which is the most frequently occuring value
info.mode()

In [ ]:
##var function :it returns the variance.
info.var()

CountryID                                                 3.417167e+03
Continent                                                 3.269814e+00
Adolescent fertility rate (%)                             2.411329e+03
Adult literacy rate (%)                                   4.168033e+02
Gross national income per capita (PPP international $)    1.584264e+08
Net primary school enrolment ratio female (%)             3.164146e+02
Net primary school enrolment ratio male (%)               2.387399e+02
Population (in thousands) total                           1.738118e+10
dtype: float64

In [82]:
##skew This method returns skewness. Skewness is indicative of the distribution
info.skew()

CountryID                                                 0.000000
Continent                                                 0.319309
Adolescent fertility rate (%)                             0.929544
Adult literacy rate (%)                                  -1.112218
Gross national income per capita (PPP international $)    1.576014
Net primary school enrolment ratio female (%)            -1.827949
Net primary school enrolment ratio male (%)              -1.954909
Population (in thousands) total                           8.445945
dtype: float64

In [83]:
##Shape function : u can know the number of colums and rows in your data 
print ("The shape of the data:",info.shape)

The shape of the data: (202, 9)

In [ ]:
# filter rows  using  the boolean expression
country_filter = info[info['Country']=='Afghanistan']
print(country_filter.shape)
country_filter.mean()

In [67]:
# Group By DataFrame on the basis of Continent column
info.groupby('CountryID').mean()

           Continent  ...  Population (in thousands) total
CountryID             ...
1                  1  ...                          26088.0
2                  2  ...                           3172.0
3                  3  ...                          33351.0
4                  2  ...                             74.0
5                  3  ...                          16557.0
...              ...  ...                              ...
198                6  ...                          86206.0
199                1  ...                              NaN
200                1  ...                          21732.0
201                3  ...                          11696.0
202                3  ...                          13228.0

[202 rows x 7 columns]

In [72]:
##grouping the dataframe based by Adult literacy rate 
info.groupby(['CountryID']).mean()['Adolescent fertility rate (%)','Continent']

                     Adolescent fertility rate (%)  ...  Population (in thousands) total
CountryID Continent                                 ...
1         1                                  151.0  ...                          26088.0
2         2                                   27.0  ...                           3172.0
3         3                                    6.0  ...                          33351.0
4         2                                    NaN  ...                             74.0
5         3                                  146.0  ...                          16557.0
...                                            ...  ...                              ...
198       6                                   25.0  ...                          86206.0
199       1                                    NaN  ...                              NaN
200       1                                   83.0  ...                          21732.0
201       3                                  161.0  ...                          11696.0
202       3                                  101.0  ...                          13228.0

[202 rows x 6 columns]

In [74]:
##grouping by multiple colums 
info.groupby(['CountryID','Continent']).mean()

                     Adolescent fertility rate (%)  ...  Population (in thousands) total
CountryID Continent                                 ...
1         1                                  151.0  ...                          26088.0
2         2                                   27.0  ...                           3172.0
3         3                                    6.0  ...                          33351.0
4         2                                    NaN  ...                             74.0
5         3                                  146.0  ...                          16557.0
...                                            ...  ...                              ...
198       6                                   25.0  ...                          86206.0
199       1                                    NaN  ...                              NaN
200       1                                   83.0  ...                          21732.0
201       3                                  161.0  ...                          11696.0
202       3                                  101.0  ...                          13228.0

[202 rows x 6 columns]

In [ ]:
countrya.head()

0     True
1    False
2    False
3    False
4    False
Name: Country, dtype: bool

In [ ]:
d =info.groupby('Continent').mean()['Adult literacy rate (%)']
d

Continent
1    76.900000
2    97.911538
3    61.690476
4    91.600000
5    87.940909
6    87.607143
7    69.812500
Name: Adult literacy rate (%), dtype: float64

In [ ]:
d =info.groupby('Continent').sum() 
d

           CountryID  ...  Population (in thousands) total
Continent             ...
1               2315  ...                         336867.0
2               5117  ...                         880241.0
3               4769  ...                         759147.0
4                394  ...                         441464.0
5               2938  ...                         453480.0
6               4243  ...                         714480.0
7                727  ...                        2859153.0

[7 rows x 7 columns]

In [ ]:
##showing last rows
info.tail()

                Country  ...  Population (in thousands) total
197             Vietnam  ...                          86206.0
198  West Bank and Gaza  ...                              NaN
199               Yemen  ...                          21732.0
200              Zambia  ...                          11696.0
201            Zimbabwe  ...                          13228.0

[5 rows x 9 columns]

In [ ]:
country_series = info['Country']
type(country_series)

pandas.core.series.Series

Day two : Pandas Joints

Here we have two dataset 
1. Dest dataset 
2. Tips dataset

In [85]:
## Louading destdataset
dest_dataset = pd.read_csv("dest.csv")
dest_dataset.head()

   EmpNr       Dest
0      5  The Hague
1      3  Amsterdam
2      9  Rotterdam

In [88]:
### Louading tips dataset
tips_dataset = pd.read_csv("tips.csv")
tips_dataset.head()

   EmpNr  Amount
0      5    10.0
1      9     5.0
2      7     2.5

In [94]:
##Joining the dataframe using inner join function 
inner_join = pd.merge(dest_dataset,tips_dataset, on ='EmpNr',how ='inner')
inner_join.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      9  Rotterdam     5.0

In [95]:
##outerjoin will return the whole records of dataframe 
outer_join = pd.merge(dest_dataset,tips_dataset,on ='EmpNr',how='outer')
outer_join.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      3  Amsterdam     NaN
2      9  Rotterdam     5.0
3      7        NaN     2.5

In [97]:
##rightjoin 
righter_join = pd.merge(dest_dataset,tips_dataset,on='EmpNr',how ='right')
righter_join.head()

<bound method NDFrame.head of    EmpNr       Dest  Amount
0      5  The Hague    10.0
1      9  Rotterdam     5.0
2      7        NaN     2.5>

In [98]:
#lefjoin 
leftjoin = pd.merge(dest_dataset,tips_dataset,on='EmpNr',how ='left')
leftjoin.head()

   EmpNr       Dest  Amount
0      5  The Hague    10.0
1      3  Amsterdam     NaN
2      9  Rotterdam     5.0

Working on Missing records

In [103]:
##checking missing valeus of the dataframe , we can check two ways using isnull function in pandas library 
##way one
missing_records = pd.isnull(info).sum()
missing_records

Country                                                    0
CountryID                                                  0
Continent                                                  0
Adolescent fertility rate (%)                             25
Adult literacy rate (%)                                   71
Gross national income per capita (PPP international $)    24
Net primary school enrolment ratio female (%)             23
Net primary school enrolment ratio male (%)               23
Population (in thousands) total                           13
dtype: int64

In [105]:
##Way two : checking missing values using isnull function 
missing_records= info.isnull().sum()
missing_records

Country                                                    0
CountryID                                                  0
Continent                                                  0
Adolescent fertility rate (%)                             25
Adult literacy rate (%)                                   71
Gross national income per capita (PPP international $)    24
Net primary school enrolment ratio female (%)             23
Net primary school enrolment ratio male (%)               23
Population (in thousands) total                           13
dtype: int64

In [111]:
##Dropping Missing values using dropna() funciton from pandas library 
drop_missing_vales = info.dropna(inplace=True)
info.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 118 entries, 1 to 200
Data columns (total 9 columns):
 #   Column                                                  Non-Null Count  Dtype
---  ------                                                  --------------  -----
 0   Country                                                 118 non-null    object
 1   CountryID                                               118 non-null    int64
 2   Continent                                               118 non-null    int64
 3   Adolescent fertility rate (%)                           118 non-null    float64
 4   Adult literacy rate (%)                                 118 non-null    float64
 5   Gross national income per capita (PPP international $)  118 non-null    float64
 6   Net primary school enrolment ratio female (%)           118 non-null    float64
 7   Net primary school enrolment ratio male (%)             118 non-null    float64
 8   Population (in thousands) total                         118 non-null    float64
dtypes: float64(6), int64(2), object(1)
memory usage: 9.2+ KB

In [113]:
##filling the missing values 
info.fillna(0, inplace=True)
info.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 118 entries, 1 to 200
Data columns (total 9 columns):
 #   Column                                                  Non-Null Count  Dtype
---  ------                                                  --------------  -----
 0   Country                                                 118 non-null    object
 1   CountryID                                               118 non-null    int64
 2   Continent                                               118 non-null    int64
 3   Adolescent fertility rate (%)                           118 non-null    float64
 4   Adult literacy rate (%)                                 118 non-null    float64
 5   Gross national income per capita (PPP international $)  118 non-null    float64
 6   Net primary school enrolment ratio female (%)           118 non-null    float64
 7   Net primary school enrolment ratio male (%)             118 non-null    float64
 8   Population (in thousands) total                         118 non-null    float64
dtypes: float64(6), int64(2), object(1)
memory usage: 9.2+ KB

Creating pivot table using pivot() function from pandas library

In [114]:
##louding purchase data 
p_data = pd.read_csv("purchase.csv")
p_data.head()

  Weather       Food     Price  Number
0    cold       soup  3.745401       8
1     hot       soup  9.507143       8
2    cold   icecream  7.319939       8
3     hot  chocolate  5.986585       8
4    cold   icecream  1.560186       8

In [116]:
## filtering on row 
row = p_data[p_data['Food']=='soup']
row.head()

  Weather  Food     Price  Number
0    cold  soup  3.745401       8
1     hot  soup  9.507143       8
6    cold  soup  0.580836       8

In [117]:
##showing the initial 20 records of the dat
initialr =p_data.head(20)
initialr

  Weather       Food     Price  Number
0    cold       soup  3.745401       8
1     hot       soup  9.507143       8
2    cold   icecream  7.319939       8
3     hot  chocolate  5.986585       8
4    cold   icecream  1.560186       8
5     hot   icecream  1.559945       8
6    cold       soup  0.580836       8

In [131]:
##creating pivot table
pd.pivot_table(p_data,values='Number',index =['Weather'],
                         columns=['Food'],aggfunc =np.sum)

Food     chocolate  icecream  soup
Weather
cold           NaN      16.0  16.0
hot            8.0       8.0   8.0